package com.example.babycare;

public class IPAD {
  public static final String ip = "babycare.sturgeon.mopaas.com";//10.187.31.111/59.78.12.115
  public static String user = "";
  public static String name="";
  public static int flag;
  public static int stop;
  public static int sex=1;
  public static int tab1 = 0;
  public static int tab2 = 0;
  public static int year = 0;
  public static int month = 0;
  public static int day = 0;
  public static String photodiscription;
  public static int isrecord = 0;
  
  public static double[][] weight_boy= new double[][]{
	  {2.26,2.58,2.93,3.32,3.73,4.18,4.66},
	  {3.09,3.52,3.99,4.51,5.07,5.67,6.33},
	  {3.94,4.47,5.05,5.68,6.38,7.14,7.97},
	  {4.69,5.29,5.97,6.70,7.51,8.40,9.37},
	  {5.25,5.91,6.64,7.45,8.34,9.32,10.39},
	  {5.66,6.36,7.14,8.00,8.95,9.99,11.15},
	  {5.97,6.70,7.51,8.41,9.41,10.50,11.72},
	  {6.24,6.99,7.83,8.76,9.79,10.93,12.20},
	  {6.46,7.23,8.09,9.05,10.11,11.29,12.60},
	  {6.67,7.46,8.35,9.33,10.42,11.64,12.99},
	  {6.86,7.67,8.58,9.58,10.71,11.95,13.34},
	  {7.04,7.87,8.80,9.83,10.98,12.26,13.68},
	  {7.21,8.06,9.00,10.05,11.23,12.54,14.00},
	  {7.68,8.57,9.57,10.68,11.93,13.32,14.88},
	  {8.13,9.07,10.12,11.29,12.61,14.09,15.75},
	  {8.61,9.59,10.69,11.93,13.33,14.90,16.66},
	  {9.06,10.09,11.24,12.54,14.01,15.67,17.54},
	  {9.47,10.54,11.75,13.11,14.64,16.38,18.36},
	  {9.86,10.97,12.22,13.64,15.24,17.06,19.13},
	  {10.24,11.39,12.68,14.15,15.82,17.72,19.89},
	  {10.61,11.79,13.13,14.65,16.39,18.37,20.64},
	  {10.97,12.19,13.57,15.15,16.95,19.02,21.39},
	  {11.31,12.57,14.00,15.63,17.50,19.65,22.13},
	  {11.66,12.96,14.44,16.13,18.07,20.32,22.91},
	  {12.01,13.35,14.88,16.64,18.67,21.01,23.73},
	  {12.37,13.76,15.35,17.18,19.30,21.76,24.63},
	  {12.74,14.18,15.84,17.75,19.98,22.57,25.61},
	  {13.12,14.61,16.34,18.35,20.69,23.43,26.68},
	  {13.50,15.06,16.87,18.98,21.46,24.38,27.85},
	  {13.86,15.48,17.38,19.60,22.21,25.32,29.04},
	  {14.18,15.87,17.85,20.18,22.94,26.24,30.22},
	  {14.48,16.24,18.31,20.75,23.66,27.17,31.43},
	  {14.74,16.56,18.71,21.26,24.32,28.03,32.57},
	  {15.01,16.90,19.14,21.82,25.06,29.01,33.89},
	  {15.30,17.27,19.62,22.45,25.89,30.13,35.41},
	  {15.66,17.73,20.22,23.24,26.95,31.56,37.39},
			};
	
  public static double[][] weight_girl= new double[][]{
	  {2.26 ,2.54 ,2.85 ,3.21 ,3.63 ,4.10 ,4.65 },
	  {2.98 ,3.33 ,3.74 ,4.20 ,4.74 ,5.35 ,6.05 },
	  {3.72 ,4.15 ,4.65 ,5.21 ,5.86 ,6.60 ,7.46 },
	  {4.40 ,4.90 ,5.47 ,6.13 ,6.87 ,7.73 ,8.71 },
	  {4.93 ,5.48 ,6.11 ,6.83 ,7.65 ,8.59 ,9.66 },
	  {5.33 ,5.92 ,6.59 ,7.36 ,8.23 ,9.23 ,10.38 },
	  {5.64 ,6.26 ,6.96 ,7.77 ,8.68 ,9.73 ,10.93 },
	  {5.90 ,6.55 ,7.28 ,8.11 ,9.06 ,10.15 ,11.40 },
	  {6.13 ,6.79 ,7.55 ,8.41 ,9.39 ,10.51 ,11.80 },
	  {6.34 ,7.03 ,7.81 ,8.69 ,9.70 ,10.86 ,12.18 },
	  {6.53 ,7.23 ,8.03 ,8.94 ,9.98 ,11.16 ,12.52 },
	  {6.71 ,7.43 ,8.25 ,9.18 ,10.24 ,11.46 ,12.85 },
	  {6.87 ,7.61 ,8.45 ,9.40 ,10.48 ,11.73 ,13.15 },
	  {7.34 ,8.12 ,9.01 ,10.02 ,11.18 ,12.50 ,14.02 },
	  {7.79 ,8.63 ,9.57 ,10.65 ,11.88 ,13.29 ,14.90 },
	  {8.26 ,9.15 ,10.15 ,11.30 ,12.61 ,14.12 ,15.85 },
	  {8.70 ,9.64 ,10.70 ,11.92 ,13.31 ,14.92 ,16.77 },
	  {9.10 ,10.09 ,11.21 ,12.50 ,13.97 ,15.67 ,17.63 },
	  {9.48 ,10.52 ,11.70 ,13.05 ,14.60 ,16.39 ,18.47 },
	  {9.86 ,10.94 ,12.18 ,13.59 ,15.22 ,17.11 ,19.29 },
	  {10.23 ,11.36 ,12.65 ,14.13 ,15.83 ,17.81 ,20.10 },
	  {10.60 ,11.77 ,13.11 ,14.65 ,16.43 ,18.50 ,20.90 },
	  {10.95 ,12.16 ,13.55 ,15.16 ,17.01 ,19.17 ,21.69 },
	  {11.29 ,12.55 ,14.00 ,15.67 ,17.60 ,19.85 ,22.49 },
	  {11.62 ,12.93 ,14.44 ,16.17 ,18.19 ,20.54 ,23.30 },
	  {11.96 ,13.32 ,14.88 ,16.69 ,18.79 ,21.25 ,24.14 },
	  {12.30 ,13.71 ,15.33 ,17.22 ,19.42 ,22.00 ,25.04 },
	  {12.62 ,14.08 ,15.78 ,17.75 ,20.05 ,22.75 ,25.96 },
	  {12.93 ,14.44 ,16.20 ,18.26 ,20.66 ,23.50 ,26.87 },
	  {13.23 ,14.80 ,16.64 ,18.78 ,21.30 ,24.28 ,27.84 },
	  {13.54 ,15.18 ,17.09 ,19.33 ,21.98 ,25.12 ,28.89 },
	  {13.84 ,15.54 ,17.53 ,19.88 ,22.65 ,25.96 ,29.95 },
	  {14.11 ,15.87 ,17.94 ,20.37 ,23.27 ,26.74 ,30.94 },
	  {14.38 ,16.21 ,18.35 ,20.89 ,23.92 ,27.57 ,32.00 },
	  {14.66 ,16.55 ,18.78 ,21.44 ,24.61 ,28.46 ,33.14 },
	  {14.96 ,16.92 ,19.25 ,22.03 ,25.37 ,29.42 ,34.40 },

		};
	

  public static double[][] height_boy= new double[][]{
	  
	  {45.2,46.9,48.6,50.4,52.2,54.0,55.8},
	  {48.7,50.7,52.7,54.8,56.9,59.0,61.2},
	  {52.2,54.3,56.5,58.7,61.0,63.3,65.7},
	  {55.3,57.5,59.7,62.0,64.3,66.6,69.0},
	  {57.9,60.1,62.3,64.6,66.9,69.3,71.7},
	  {59.9,62.1,64.4,66.7,69.1,71.5,73.9},
	  {61.4,63.7,66.0,68.4,70.8,73.3,75.8},
	  {62.7,65.0,67.4,69.8,72.3,74.8,77.4},
	  {63.9,66.3,68.7,71.2,73.7,76.3,78.9},
	  {65.2,67.6,70.1,72.6,75.2,77.8,80.5},
	  {66.4,68.9,71.4,74.0,76.6,79.3,82.1},
	  {67.5,70.1,72.7,75.3,78.0,80.8,83.6},
	  {68.6,71.2,73.8,76.5,79.3,82.1,85.0},
	  {71.2,74.0,76.9,79.8,82.8,85.8,88.9},
	  {73.6,76.6,79.6,82.7,85.8,89.1,92.4},
	  {76.0,79.1,82.3,85.6,89.0,92.4,95.9},
	  {78.3,81.6,85.1,88.5,92.1,95.8,99.5},
	  {80.5,83.9,87.5,91.1,94.8,98.6,102.5},
	  {82.4,85.9,89.6,93.3,97.1,101.0,105.0},
	  {84.4,88.0,91.6,95.4,99.3,103.2,107.2},
	  {86.3,90.0,93.7,97.5,101.4,105.3,109.4},
	  {87.5,91.2,94.9,98.8,102.7,106.7,110.7},
	  {89.3,93.0,96.7,100.6,104.5,108.6,112.7},
	  {90.9,94.6,98.5,102.4,106.4,110.4,114.6},
	  {92.5,96.3,100.2,104.1,108.2,112.3,116.5},
	  {94.0,97.9,101.9,105.9,110.0,114.2,118.5},
	  {95.6,99.5,103.6,107.7,111.9,116.2,120.6},
	  {97.1,101.1,105.3,109.5,113.8,118.2,122.6},
	  {98.7,102.8,107.0,111.3,115.7,120.1,124.7},
	  {100.2,104.4,108.7,113.0,117.5,122.0,126.7},
	  {101.6,105.9,110.2,114.7,119.2,123.8,128.6},
	  {103.0,107.3,111.7,116.3,120.9,125.6,130.4},
	  {104.1,108.6,113.1,117.7,122.4,127.2,132.1},
	  {105.3,109.8,114.4,119.2,124.0,128.8,133.8},
	  {106.5,111.1,115.8,120.7,125.6,130.5,135.6},
	  {107.9,112.6,117.4,122.3,127.3,132.4,137.6},
		/*	{47.0,48.7,50.4,52.1,53.8},
			{52.3,54.6,56.9,59.2,61.5},
			{55.6,58.0,60.4,62.8,65.2},
			{58.4,60.7,63.0,65.3,67.6},
			{60.7,62.9,65.1,67.3,69.5},
			{62.4,64.7,67.0,69.3,71.6},
			{64.4,66.8,69.2,71.6,74.0},
			{67.0,69.5,72.0,74.5,77.0},
			{69.4,72.0,74.6,77.2,79.8},
			{71.9,74.6,77.3,80.0,82.7},
			{74.7,77.5,80.3,83.1,85.9},
			{76.5,79.6,82.7,85.8,88.9},
			{79.2,82.4,85.6,88.8,92.0},
			{82.3,85.7,89.1,92.5,95.9},
			{86.3,89.8,93.3,96.8,100.3},
			{89.4,93.1,96.8,100.5,104.2},
			{92.6,96.4,100.2,104.0,107.8},
			{95.5,99.6,103.7,107.8,111.9},
			{98.9,103.0,107.1,111.2,115.3},
			{102.1,106.3,110.5,114.7,118.9},
			{104.7,109.2,113.7,118.2,122.7},
			{108.5,113.2,117.9,122.6,127.3},
			{112.5,118.2,123.9,129.6,135.3},
			{116.8,122.7,128.6,134.5,140.4},
			{121.6,127.7,133.8,139.9,146.0},
			{125.6,132.2,138.8,145.4,152.0},
			{130.1,137.3,144.5,151.7,158.9},
			{134.0,142.2,150.4,158.6,166.8},
			{142.1,150.4,158.7,167.0,175.3},
			{149.5,156.9,164.3,171.7,179.1},
			{155.0,161.3,167.6,173.9,180.2},
			{157.3,163.4,169.5,175.6,181.7},
			{158.3,164.3,170.3,176.3,182.3},*/
};

  public static double[][] height_girl= new double[][]{
	  {44.7,46.4,48.0,49.7,51.4,53.2,55.0},
	  {47.9,49.8,51.7,53.7,55.7,57.8,59.9},
	  {51.1,53.2,55.3,57.4,59.6,61.8,64.1},
	  {54.2,56.3,58.4,60.6,62.8,65.1,67.5},
	  {56.7,58.8,61.0,63.1,65.4,67.7,70.0},
	  {58.6,60.8,62.9,65.2,67.4,69.8,72.1},
	  {60.1,62.3,64.5,66.8,69.1,71.5,74.0},
	  {61.3,63.6,65.9,68.2,70.6,73.1,75.6},
	  {62.5,64.8,67.2,69.6,72.1,74.7,77.3},
	  {63.7,66.1,68.5,71.0,73.6,76.2,78.9},
	  {64.9,67.3,69.8,72.4,75.0,77.7,80.5},
	  {66.1,68.6,71.1,73.7,76.4,79.2,82.0},
	  {67.2,69.7,72.3,75.0,77.7,80.5,83.4},
	  {70.2,72.9,75.6,78.5,81.4,84.3,87.4},
	  {72.8,75.6,78.5,81.5,84.6,87.7,91.0},
	  {75.1,78.1,81.2,84.4,87.7,91.1,94.5},
	  {77.3,80.5,83.8,87.2,90.7,94.3,98.0},
	  {79.3,82.7,86.2,89.8,93.5,97.3,101.2},
	  {81.4,84.8,88.4,92.1,95.9,99.8,103.8},
	  {83.4,86.9,90.5,94.3,98.1,102.0,106.1},
	  {85.4,88.9,92.5,96.3,100.1,104.1,108.1},
	  {86.6,90.1,93.8,97.5,101.4,105.4,109.4},
	  {88.4,91.9,95.6,99.4,103.3,107.2,111.3},
	  {90.1,93.7,97.4,101.2,105.1,109.2,113.3},
	  {91.7,95.4,99.2,103.1,107.0,111.1,115.3},
	  {93.2,97.0,100.9,104.9,109.0,113.1,117.4},
	  {94.8,98.7,102.7,106.7,110.9,115.2,119.5},
	  {96.4,100.3,104.4,108.5,112.8,117.1,121.6},
	  {97.8,101.8,106.0,110.2,114.5,118.9,123.4},
	  {99.3,103.4,107.6,111.9,116.2,120.7,125.3},
	  {100.7,104.9,109.2,113.5,118.0,122.6,127.2},
	  {102.0,106.3,110.7,115.2,119.7,124.4,129.1},
	  {103.2,107.6,112.0,116.6,121.2,126.0,130.8},
	  {104.4,108.8,113.4,118.0,122.7,127.6,132.5},
	  {105.5,110.1,114.7,119.4,124.3,129.2,134.2},
	  {106.7,111.4,116.1,121.0,125.9,130.9,136.1},

};

  public static double[][] breast_boy= new double[][]{
	  {30.9,32.1,33.3,34.5,35.7,36.8,37.9},
	  {33.3,34.5,35.7,36.9,38.2,39.4,40.7},
	  {35.2,36.4,37.6,38.9,40.2,41.5,42.9},
	  {36.7,37.9,39.2,40.5,41.8,43.2,44.6},
	  {38.0,39.2,40.4,41.7,43.1,44.5,45.9},
	  {39.0,40.2,41.5,42.7,44.1,45.5,46.9},
	  {39.8,41.0,42.3,43.6,44.9,46.3,47.7},
	  {40.4,41.7,42.9,44.2,45.5,46.9,48.4},
	  {41.0,42.2,43.5,44.8,46.1,47.5,48.9},
	  {41.5,42.7,44.0,45.3,46.6,48.0,49.4},
	  {41.9,43.1,44.4,45.7,47.0,48.4,49.8},
	  {42.3,43.5,44.8,46.1,47.4,48.8,50.2},
	  {42.6,43.8,45.1,46.4,47.7,49.1,50.5},
	  {43.2,44.5,45.7,47.0,48.4,49.7,51.1},
	  {43.7,45.0,46.3,47.6,48.9,50.2,51.6},
	  {44.2,45.5,46.7,48.0,49.4,50.7,52.1},
	  {44.6,45.9,47.1,48.4,49.8,51.1,52.5},
	  {45.0,46.2,47.5,48.8,50.1,51.4,52.8},
	  {45.3,46.5,47.8,49.1,50.4,51.7,53.1},
	  {45.5,46.8,48.0,49.3,50.6,52.0,53.3},
	  {45.7,47.0,48.3,49.6,50.9,52.2,53.5},
	  {46.2,47.4,48.7,49.9,51.3,52.6,53.9},
	  {46.5,47.8,49.0,50.3,51.6,52.9,54.2},
	  {46.9,48.1,49.4,50.6,51.9,53.2,54.6},
	  {47.2,48.4,49.7,51.0,52.2,53.6,54.9},
	  {47.5,48.7,50.0,51.3,52.5,53.8,55.2},
	  {47.8,49.0,50.2,51.5,52.8,54.1,55.4},

};

  public static double[][] breast_girl= new double[][]{
	  {30.4,31.6,32.8,34.0,35.2,36.4,37.5},
	  {32.6,33.8,35.0,36.2,37.4,38.6,39.9},
	  {34.5,35.6,36.8,38.0,39.3,40.5,41.8},
	  {36.0,37.1,38.3,39.5,40.8,42.1,43.4},
	  {37.2,38.3,39.5,40.7,41.9,43.3,44.6},
	  {38.1,39.2,40.4,41.6,42.9,44.3,45.7},
	  {38.9,40.0,41.2,42.4,43.7,45.1,46.5},
	  {39.5,40.7,41.8,43.1,44.4,45.7,47.2},
	  {40.1,41.2,42.4,43.6,44.9,46.3,47.7},
	  {40.5,41.7,42.9,44.1,45.4,46.8,48.2},
	  {40.9,42.1,43.3,44.5,45.8,47.2,48.6},
	  {41.3,42.4,43.6,44.9,46.2,47.5,49.0},
	  {41.5,42.7,43.9,45.1,46.5,47.8,49.3},
	  {42.2,43.4,44.6,45.8,47.2,48.5,50.0},
	  {42.8,43.9,45.1,46.4,47.7,49.1,50.5},
	  {43.2,44.4,45.6,46.9,48.2,49.6,51.0},
	  {43.6,44.8,46.0,47.3,48.6,50.0,51.4},
	  {44.0,45.2,46.4,47.7,49.0,50.3,51.7},
	  {44.3,45.5,46.7,48.0,49.3,50.7,52.1},
	  {44.6,45.8,47.0,48.3,49.6,50.9,52.3},
	  {44.8,46.0,47.3,48.5,49.8,51.2,52.6},
	  {45.3,46.5,47.7,49.0,50.3,51.6,53.0},
	  {45.7,46.9,48.1,49.4,50.6,52.0,53.3},
	  {46.0,47.2,48.4,49.7,51.0,52.3,53.7},
	  {46.3,47.5,48.7,50.0,51.3,52.6,53.9},
	  {46.6,47.8,49.0,50.3,51.5,52.8,54.2},
	  {46.8,48.0,49.2,50.5,51.8,53.1,54.4},

};
  
  public static String[][] content ={
	  {"小于1个月的宝宝，看起来不健康（呕吐、咳嗽，面色差），或其他表现异常（拒食或嗜睡），这些症状是很严重的，除非已经能够明确病因。婴儿第一个月，感染可发展迅速。",
		  "你的孩子盯着一个地方发呆，不会笑，也不会玩耍或几乎不回应你。可能是你的孩子太虚弱以至于没有力气哭、难以唤醒。这些都是严重的症状。注：生病时多睡觉是正常的，但清醒时，你的孩子应该是反应灵敏的。",
		  "突然发生混乱（谵妄）。你的孩子是清醒的，但说奇怪的东西，看到奇怪的东西，不认识你。注意：5分钟左右的高热即可表现为瞬时谵妄。然而，如果并不短暂，意识模糊可能是由一些严重的原因引起的。",
		  "剧烈疼痛可能干扰正常活动。孩子只是想一个人呆着。如果当您试图抱他或移动他时孩子不停地哭泣，这可以是脑膜炎或阑尾炎的一个症状。儿童无法入睡或只能浅睡。",
		  "哭闹不止很可能是由于剧烈的疼痛，除非已经明确哭泣的原因。当孩子很难入睡或仅能浅睡，或者清醒时也不能参与任何正常活动时，即应引起高度重视。注意：除了持续哭闹，剧烈的疼痛也可能会导致你的孩子呻吟，叹息或呜咽。",
		  "如果您的孩子本来已经学会走路，然后失去站立或行走的能力，他可能有严重的腿部外伤或存在平衡问题。如果您的孩子走路弯着腰、双手捧腹，他可能有严重的疾病，如阑尾炎。",
		  "让孩子坐在你的腿上，按压孩子的腹部。如果在腹部的各个部分都能够按压大约3cm深度，基本可以认为孩子没有问题。如果按压时，孩子畏缩或尖叫，这说明很严重的表征。如果不仅仅是按压疼痛，孩子的腹部还存在腹胀的现象，那么问题更是令人担忧。注意：如果你的孩子只是推你的手移开，这可能意味着你没有分散他的注意力。",
		  "在腹股沟区突发疼痛可以是睾丸扭转。这就要求在8小时内手术挽救睾丸。",
		  "呼吸是维持生命所必须的。多数儿童是由于严重的呼吸问题死亡的。如果您的孩子有呼吸困难、哮鸣音（呼吸时发出刺耳的声音），明显喘息或每次呼吸发出咕噜声，她需要立即就诊。呼吸急促的其他症状：呼吸深快，口唇青紫，或肋骨间隙呼吸时凹陷。有严重的呼吸窘迫的儿童，不能喝水、不能说话或不能哭。注意：鼻塞引起的鼻翼煽动和一些呼吸声音急促，但通常没有任何呼吸困难。清理鼻孔、洗鼻后，再次检查呼吸。",
		  "口唇青紫，舌、牙龈发绀可能意味着血液中的氧气量不足。注意：只有嘴巴周围（但不是嘴唇）青紫可能是因为寒冷而引起的。",
		  "当你的孩子生病时突然流口水，或吐痰意味着你的孩子有吞咽困难。原因可能是扁桃体严重感染，喉咙，或会厌部炎症。严重的过敏反应也可引起吞咽困难。肿胀的喉咙可以闭塞气道。",
		  "脱水就是说，你的孩子的体液偏少。脱水通常伴随严重呕吐和/或腹泻。如果你的孩子没有在8小时（如果超过1岁则放宽到12小时）小便;哭时无泪，口腔干的，而不是潮湿，或在颅骨前囟凹陷——则应怀疑孩子有脱水症状。脱水的孩子也会出现疲乏无力。如果你的孩子是警觉和活跃，只是尿量较少，他还没有脱水。严重脱水的孩子站立时会头晕。脱水需要立即补液口服或静脉。",
		  "宝宝的头部有柔软、但是凸起的斑点时，这意味着颅内压较高。",
		  "为了测试颈部僵硬程度，让你的孩子躺下来，然后 抬起他的头，直到下巴触及胸部中间。如果他对这个动作表现出反感或抵抗，在他的腹部放置玩具或其他感兴趣的对象，所以他将不得不往下看才能看到它。对于年龄较大的儿童，可以简单地要求他们看他们的肚脐。颈部僵硬是脑膜炎的早期征兆之一。",
		  "一旦孩子颈部受伤，一定要通知医生，不管有没有相应的症状出现。颈部受伤伴随损伤脊髓的危险。",
		  "对皮肤原因不明的紫色或血红色的斑点或点可能是一个严重的血液感染的迹象，特别是如果你的孩子还发热的话。注：擦伤和碰伤的淤青是不一样的。",
		  "在婴幼儿细菌感染可引起严重的并发症。所有的孩子不到3个月的婴儿发热需要尽快进行检查，以确定原因是病毒或细菌。",
		  "很多症状是严重疾病的指证，甚至比发热程度更敏感。所有的人可发生低热以及高热。单独发热只有当温度高于105F（40.6C）才被认为是严重感染的危险因素。因此，如果您的孩子有上述104°F（40°C）发热服用退烧药后不下来低于104°F（40°C），打电话给医生。",
		  "大多数活动期的慢性疾病可以引起很多并发症。如果您的孩子有慢性疾病，一定要能够识别并辨认这些并发症。慢性疾病的风险最高严重感染是那些削弱免疫系统的疾病（如镰状细胞病，艾滋病，化疗，器官移植等）。如果医生或护士对你的孩子并不熟悉和了解，务必告诉他们你的孩子的慢性疾病（如哮喘等）。永远不要假设他们已经知道这一点。"
	  },
	  {"抗生素 有较强的药物作用，可以杀死细菌。抗生素拯救了许多生命，能够防止细菌并发症。然而，抗生素不杀病毒。医务工作者每天都在鉴别孩子的感染时细菌性的还是病毒性的。",
		  "细菌感染比病毒感染少见。细菌引起:\n大部分耳部感染（但它们只发生于小儿感冒的5％）\n大多数 鼻窦感染  (但它们只发生于小儿感冒的5％）\n20％ 喉咙痛（链球菌咽部感染）\n10％的 肺炎 （细菌性肺部感染）",
		  "病毒引起大多数儿童感冒：\n感冒目前不到2个星期，除非他们变成一个中耳炎或鼻窦感染\n3周以内的咳嗽，除非他们并发细菌性肺炎\n 95％的 发热\n 80％喉咙痛\n 90％肺炎（大多数小儿肺炎是由病毒引起）\n 99％的 腹泻和呕吐",
		  "以下症状常被误认为细菌感染的体征和理由，开始抗生素：\n 绿色或黄色鼻涕。绿色或黄色分泌物通常是风寒恢复过程中的正常阶段，\n而不是鼻窦感染的证据。\n绿色或黄色的痰。这是\n毒性支气管炎的表现之一，而不是肺炎的征兆。\n高烧。发高烧（超过104°F或40°C）可以由病毒或细菌引起的。",
		  "所有抗生素都有副作用。除非你的孩子真正需要抗生素，没有理由冒险使用抗生素。服用抗生素会使部分孩子出现腹泻，恶心，呕吐，或皮疹。腹泻通常是因为抗生素杀死了体内正常的肠道细菌。如果您的孩子出现皮疹，医生必须决定这个皮疹是否是一种过敏性反应的药物。过度使用的最大的副作用是增加抗生素耐药。",
		  "如果您的孩子有一个病毒感染，抗生素不会缩短发热的时间长短或者缓解症状。抗生素不会使你的孩子回到学校或你回去工作更快。如果您的孩子并发抗生素的副作用，他会感觉更糟，而不是更好。",
		  "除抗生素诊断细菌感染时，你的孩子才真的需要抗生素\n不要强迫医生开抗生素处方\n用合适的家庭治疗恢复方法治疗孩子的感冒和咳嗽\n请记住，发热是与病原体战斗和产生抗体的过程从而对于将来的病毒感染产生免疫力。",
	  },  
	  {
		 "过度的非处方类感冒咳嗽药可引起幼儿严重的副作用。使用这些药物的风险大于从减少症状的任何好处。因此，在2008年10月，美国FDA（食品和药物管理局）建议非处方咳嗽和感冒药禁止在4岁以下的儿童使用。从4岁到6日，只有医生建议使用时才可以使用。6岁以后，药物可以安全使用，但需要按照包装上的用量说明。幸运的是，没有这些非处方药，你也可以轻松地治疗孩子咳嗽和感冒。",
		"一个良好的家庭治疗是安全的，价格便宜，而且是有益的非处方药。他们还发现，在几乎每一个家庭。你都可以用简单而有效的家庭疗法代替药物治疗，来缓解孩子的症状。\n"+
		"流涕：吸出鼻。请记住，当你的孩子的鼻子跑起来像一个水龙头，它肯定与病毒感染脱不开干系。药物：}抗组胺药（如苯海拉明）对于一般的感冒没有作用。但是，如果他们的鼻涕是由于过敏性鼻炎（抗组胺药是有效的）。\n"+
		"鼻塞： 使用鼻洗液。\n"+
		"用盐水鼻喷雾剂或滴剂湿润干燥的黏膜，然后吹或吸鼻子。如果没有鼻喷雾剂，温开水也可以。\n"+
		"在每个鼻孔滴2-3滴。一次滴一个鼻孔。然后吸或吹。青少年可以只吸温水入鼻。重复滴加鼻洗液，直到冲洗液清澈。\n"+
		"只要您的孩子无法通过鼻子呼吸，就冲洗鼻孔。对于还在喂奶的婴儿，在喂养前冲洗鼻孔。\n"+
		"生理盐水滴鼻剂和喷雾剂可所有药房买到，不需要处方。自己制作也可以，加食盐2毫升，以温水1杯冲开。\n"+
		"用湿棉棒去除鼻腔内分泌物。\n"+
		"药物：没有药物可以从鼻子去除已经干燥的粘液或脓液。\n"+
		"咳嗽： 用自制的止咳药。\n"+
		"年龄3个月以上至1年的婴儿：用温暖清澈的液体（例如水或苹果汁）。【用法用量】：咳嗽时1-3茶匙（5-15毫升），每日四次。避免蜂蜜，因为它可能会导致婴儿肉毒杆菌中毒。如果月龄小于3个月，及时就诊。\n"+
		"年龄1岁以上：用蜂蜜1/2至1茶匙（2〜5毫升），如果需要的话。它可稀释分泌物和放松咳嗽。（如果没有蜂蜜，可以使用玉米糖浆。）最近的研究（12/2007）的研究表明，蜂蜜比药店止咳糖浆时降低咳嗽频率和夜间咳嗽的严重程度的效果更好。\n"+
		"6岁及以上：将止咳糖浆涂在红肿的喉咙。（如果没有，可以使用硬糖。）\n"+
		"补液：帮助你的孩子补充大量的液体。留充足的水分稀释身体的分泌物，使其更容易咳嗽，吹鼻。\n"+
		"湿度：如果您家环境较为干燥，使用加湿器。潮湿的空气能够防止鼻腔黏膜干燥并润滑呼吸道。\n",
		"如果症状不干扰孩子的日常生活，他们并不需要药物治疗。许多孩子有咳嗽或鼻塞的症状，但是依旧心情愉悦，玩耍正常，睡眠安稳。  只有当这些症状引起孩子不适，睡眠中断，或者干扰孩子的日常学习生活时，才需要治疗。由于发热是有益的，除非他们影响孩子正常学习生活或者引起不适，无需特殊处理。通常不会引起不适，直到102°F（39°C）或更高。对乙酰氨基酚 （如泰诺）或 布洛芬   （如布洛芬或布洛芬）可以在这些情况下治疗发热或疼痛。（见用法用量表格适应症和年龄限制）。",
	  	"如果需要咳嗽和感冒治疗，家庭疗法可能比药物更好。"
	  },
	  {
		  "小于90日龄小儿有突然发作的原因不明的哭泣\n哭泣 是唯一的症状\n 孩子越小，就越难以查明哭闹的原因",
		  "饥饿，困倦，：新发哭闹的常见原因。疼痛，太冷，太热，衣服太紧\n反复发作的哭闹：正常的情绪波动。当这种情况发生在3小时/天，这就是所谓的   绞痛 。肠内气体不会引起哭闹。所有的婴儿啼哭时肠内都会通过大量的气体，从而使发出大量噪音。这些气体是哭闹时从口中进入的。该气体是正常的，它不会被截留，也不引起任何疼痛。\n食物过量：有些宝宝哭，因为过度喂食导致腹胀。不同于气体，过度的牛奶可引起腹部暂时性的不适。",
		  "每天过度哭闹一次或两次\n通常抱起或者安慰时，哭闹减轻\n两次哭泣之间行为正常（快乐，知足）\n宝宝吃的量够，不是饿了\n宝宝没有生病\n通常2周岁前起病\n3月龄或4月龄后自行缓解。"
	  },
	  {
		  "过度哭闹，易激惹或 烦躁\n孩子太小所以无法告诉我们他哭泣的原因\n哭泣 是唯一的症状",
		  "主要原因：疾病。年幼的孩子生病时会哭，即使他们没有任何疼痛。\n身体上的疼痛：疼痛的原因包括耳痛，咽喉肿痛，口腔溃疡，生尿布疹，对阴茎的尖端尿道外口溃疡，便秘等。\n行为的原因：过度疲劳，压力大，抱怨，发脾气，分离 焦虑。哭泣也发生在睡眠习惯重塑项目过程中。一些还不会说话的孩子（2岁前），哭是唯一的表达方式，任何原因都可能引起哭闹。\n出牙：一般出牙不会引起哭闹。\n肠道积气。\n饥饿：不会是饥饿引起的，因为这个年龄还不理解饥饿。\n药物（伪麻黄碱或去氧肾上腺素）也可引起颤抖和哭泣在一些儿童。（注：FDA不建议给4岁的孩子使用感冒咳嗽药。）",
	  },
	  {
		"以下表现意味着你的孩子发热了：\n\t直肠，或耳颞动脉 （TA）温度：100.4°F（38.0°C）或更高\n\t口服或奶嘴温度：100°F（37.8°C）或更高\n\t下摆臂（腋窝或腋下）温度：99°F（37.2°C）或更高\n注意：耳朵（鼓膜）的温度是不可靠的前6个月的年龄\n颞浅动脉和皮肤红外温度在婴幼儿中是可靠地（新研究）\n使用这个指引，如果发热是孩子的唯一症状"  ,
		"主要的原因：感冒等病毒感染\n发热可能是第一个24小时（即病毒性发热）的唯一症状。症状（如流鼻涕，咳嗽，腹泻等）可能出现地较晚。在出红疹的情况下，发热可能是2-3天内唯一的症状。\n发热的原因通常无法确定，直到其他症状出现。这些症状出现可能需要24小时。\n细菌感染（如链球菌性喉炎或尿路感染）也会引起发热\n出牙 不会引起发热",
		"发热本身应该不会造成哭泣\n发热的孩子频繁哭泣可能是由于疼痛，除非明确疼痛的原因。\n可能隐藏的原因是耳部感染，尿路感染，喉咙痛及脑膜炎等。",
		"直肠：98.6°F（37°C）读数仅仅是平均直肠温度。它通常可以从96.8°F（36°C）波动到100.3°F（37.9°C），清晨体温最低，下午傍晚体温最高。\n口温：97.6°F（36.5°C）是平均口腔温度。它通常可以从95.8°F（35.5℃）波动到99.9°F（37.7°C），清晨温度最低，下午傍晚温度最高。",
		"退热后孩子可以回到幼儿园或者学校，直到高热已经消退；如果你的孩子感觉好转，可以参与正常的活动。"
	  },
	  {
		"关于发热的误解是家常便饭。孩子出现发热时，许多家长会不必要的担心甚至失眠。这就是所谓的发热恐惧症。总体而言，发热是无害的。让下面的事实帮你从科学的角度看待发热：\n\n"+
		"谣言：我的孩子感到热，她就有发热。\n事实： 孩子们可以感受到热的原因有很多，如玩耍激烈，哭闹，温暖的大床出来或在大热天呆在外面。他们是“放出热量”。他们的皮肤温度应在10到20分钟，回归到正常。一旦这些原因都被排除，约80％的孩子感到热和感到虚弱实际上发热。如果你想确定，   可以帮他们测量体温 。以下是在不同部位测量体温时的发热临界值：\n直肠 ，或耳颞动脉温度计：100.4°F（38.0°C）或更高\n口腔或奶嘴体温计：100°F（37.8°C）或更高\n下摆臂（腋窝或腋下）温度：99°F（37.2°C）或更高\n谣言：所有的发热对孩子都是有害的。\n\n"+
		"事实： 发热可以开启人体的免疫系统，帮助人体抵抗感染。发热是人体的保护机制之一。100°和104°F之间的正常发热（37.8° - 40°C）是对生病的孩子其实是好的。\n谣言：发热高于104°F（40°C）是危险的，可能造成脑损伤。\n\n"+ 
		"事实： 发热与感染不会造成脑损伤。仅机身温度高于108°F（42°C）可引起脑损伤。 体温这么高只能在极端的环境下才会发生（例如，如果一个孩子在炎热的天气被限制在一个封闭的汽车）。\n谣言： 任何人都可以有 热性惊厥 （癫痫发作的发热触发）。\n\n"+
		"事实： 只有4％的儿童会出现热性惊厥。\n谣言： 高热惊厥是有害的。\n\n"+
		"事实：高热惊厥看起来可怕，但他们通常在5分钟内停止。他们不会造成永久性伤害。曾发生过高热惊厥的孩子没有一个出现更大的风险，不会导致发育迟缓 ， 学习障碍 或 癫痫发作 或不发热时出现惊厥。\n谣言：所有的发热需要用退烧药治疗。\n\n"+
		"事实：只有发热导致孩子不适时才需要治疗。通常发热不引起任何不适，直到他们高于102°或103°F（39°或39.5°C）。\n谣言：如果不进行治疗，发热体温会继续升高。\n\n"+
		"事实：这是错误的。因为大脑有一个温度控制中枢（相当于温控器），由于感染导致的发热通常不会高于103°或104°F（39.5° - 40°C）。他们很少升高到105°或106°F（40.6°和41.1°C）。而后者是高热，它们大多数时候是无害的。\n谣言： 经过治疗，发热应该回落到正常。\n\n"+
		"事实： 经过治疗，发热通常会下降2°或3°F（1°或1.5°C）。\n谣言： 如果发热不下来，原因是严重的。\n\n"+
		"事实： 发热对退热药不敏感，可能因为发热是由病毒或细菌引起的。 它感染的严重性并非正比例关系。\n谣言：如果药物是体温退热，那么这种效果应该是持久的。\n\n"+
		"事实： 病毒感染引起的发热通常持续2〜3天。 因此，当退烧药停用时，会再次发热，需要再次治疗。   只有孩子的身体免疫力压倒病毒（通常是第四天），可能发生退热并且没有重新发热的现象。\n谣言： 如果发热高，原因是严重的。\n\n"+
		"事实：如果发热较高，其原因可能会也可能不会很严重。如果你的孩子看起来很不舒服、很虚弱，病因更可能是严重的。\n谣言： 温度的确切数目是非常重要的。\n\n"+
		"事实： 你的孩子的表现看起来更重要，而非确切的温度。\n谣言：口腔内温度98.7° 和100°F（37.1°至37.8°C）之间属于低烧。\n\n"+
		"事实：这些是体温的正常波动。人体的正常温度全天都会发生波动。其峰值在傍晚和晚上。实际上，低烧是100°F至102°F（37.8° - 39°C）。\n总结：   请记住，发热是在击退你的孩子的感染。发热并非一件坏事。"
	  },
	  {
		  "定义\n 头部受伤\n头部受伤的类型\n头皮损伤：大部分头部受伤不仅会破坏头皮（切口伤，刮，瘀伤或肿胀）。跌倒、碰伤头部，这在孩子的成长过程中是很常见的，这在孩子刚学会走路时十分常见。因为头皮内供血充足，所以一点小擦伤可能也会引起大的淤青。出于同样的原因，小伤口在头部可能出血很多。在前额擦伤，有时会导致1-3天的黑眼圈，因为血液通过重力向下扩大。\n颅骨骨折：只有1-2％的儿童头部受伤会导致颅骨骨折。通常没有其它的症状，除了头部被击中时会感到头痛。 多数颅骨骨折不会伤害到大脑，他们很容易治愈。",
		  "脑震荡：脑震荡 是一种轻微的损伤。它通常是由一个突如其来的打击或撞击到头部引起的。 许多孩子磕碰或打他们的头并不会造成脑震荡。最常见的脑震荡的迹象是短暂的意识混乱或记忆丧失。脑震荡的其他迹象包括头痛，呕吐，头晕，头昏行事，或者晕倒。脑震荡患者不一定会出现晕厥现象。脑震荡之后，部分孩子会出现其他的症状，如轻度头痛，头晕，思维混乱，或持续数周的情绪变化。\n"+
		  "脑损伤并不常见，但出现以下症状时应予以注意：（1）难以唤醒，或难以保持清醒（2）思维混乱（3）言语不清（4）手臂或腿部控制不良（5）走路不稳。"

	  },
	  {
		  "头皮或前额区疼痛或不适\n脸部和耳朵不包含在内",
		  "病毒性疾病：大多数头痛是一种病毒疾病的一部分，尤其是感冒。这些症状通常持续数天。\n"+
		  "肌紧张性头痛：经常性头痛最常见的类型。肌紧张性头痛让人感觉头部周围紧缩压迫。颈部肌肉也变得疼痛和紧张。紧张性头痛可能是由于保持一个姿势的时间太长，如与读书或使用计算机时。其他的孩子们紧张性头痛为   应激反应 ，如压学习压力大或家庭分歧。\n"+
		  "偏头痛：经常性的严重头痛\n"+
		  "其他常见原因：饥饿，劳累，暴晒，咳嗽\n"+
		  "额窦炎：可引起前额头痛，且主要位于眉毛上方。小于10岁很少出现，因为额窦没有发展完全。其他鼻旁窦会引起面部疼痛，而不是头疼。\n"+
		  "严重的原因： 脑膜炎   或脑炎。症状包括头痛，颈部僵硬，呕吐，发热和混乱。"
	  },
	  {
		  "暴露在炎热的天气高温环境或进行剧烈的体力活动后会出现相应的症状。",
		  "有3种主要的热反应类型：\n中暑或日射病 ：症状包括皮肤潮红，高热，直肠体温超过105°F（40.5°C）；大约50%患儿没有出汗；意识模糊或昏迷；休克。直肠温度比口腔温度更准确。中暑是一种威胁生命的紧急情况，如不及时治疗死亡率也很高。\n热衰竭 ：症状包括皮肤苍白，一般无发热，但可暂时升高到37.8 - 39℃;大量出汗，恶心， 头晕，昏厥 ，或虚弱。大部分症状是由于出汗过多导致脱水而引起的。因为一个人可以从热衰竭进展到中暑，所有症状严重的患者（比如，昏厥）需要立即检查。症状较轻的患者（如头晕或   发热 ），当他对补液和休息反应不良时，他需要接受治疗。\n热痉挛 ：在腿部（尤其是小腿或大腿肌肉）和腹部存在严重的肌肉痉挛。无发热。可能发生胸闷和手部痉挛",
		  "所有3种反应是由暴露于高温常与高湿度引起的。\n在炎热的天气锻炼或其他剧烈活动/劳动可能会导致产热量超过热损失。\n出汗导致的轻度脱水会增加热反应的风险。\n婴儿风险更高，因为他们在高热条件下不太能出汗。\n中暑（温度调节机制紊乱）通常发生在暴露于高温环境之后（如被困在热车里面，蒸汽帐篷，靠近散热器或高热天气室内时无空调时）。",
		  "马上拨打急救电话120。\n等待急救人员的时候赶快帮孩子降温，越快越好。\n把他移动到阴凉处或有空调的房间。\n用冷水海绵擦拭整个身体表面（只要不引起寒战，越凉越好）。\n帮孩子扇扇子或者打开风扇，以增加蒸发。\n抬高脚部，预防休克。\n如果孩子醒了，给予尽可能多的凉水喝，只要他或她还可以耐受。\n退烧药对于中暑是没有任何作用的。",
		  "把孩子在阴凉的地方。让他躺下抬高脚部。\n把他把衣服脱掉，以便他的身体更好地散热。\n冷水浸湿海绵擦拭整个身体表面（只要不因其寒战，越凉越好）。风扇孩子从蒸发增加热量损失。帮孩子扇扇子或者打开风扇，以增加蒸发。\n尽可能多地给孩子冷水喝，只要孩子可以忍受，直到他或她感觉有好转。\n对于症状严重的，开车载孩子去医院。"
	  },
	  {
		  "如果他们有任何下列条件，孩子被认为发生并发症的风险较高：\n肺部疾病（例如 哮喘 ）\n心脏疾病   （如先天性心脏疾病）\n癌症或免疫系统缺陷的条件\n神经肌肉疾病（如 肌营养不良症 ）\n糖尿病，镰状细胞病，肾脏疾病或肝脏疾病\n需要长期服用阿司匹林治疗的疾病\n怀孕\n2岁以下健康儿童也被认为是高风险的\n注：所有其他的孩子被划分到低风险组",
		  "为了达到最佳效果，抗病毒药物（如达菲）应在48小时流感症状开始的内使用。\nAAP建议他们可用于：1）任何病人出现严重症状2）大多数高危儿童（请参阅列表）任何流感症状。美国儿科学会建议不要将抗病毒药物用于有轻度或中度的流感疾病的低风险的儿童。\n他们的作用是有限的：它们通常能够只能缩短您的孩子生病大概1-2天时间。他们减轻症状，不消灭病毒\n副作用：患儿的10％会出现呕吐 。\n"
	  }
	  
	  
  };  
}
